#include <iostream>
using namespace std;

int main()
{
	system("color 1f");
	setlocale(LC_ALL, ".1251");

	int N, c, count;
	
	cout << "\n\tПерший варiант рiшення:\n";
	cout << "\t-------------------------------------------\n";
	count = 0;
	for (int d = 0; d < 28; d++)
	{

		N = d;
		c = 0;
		cout << "\n\t(N<28)  сума перших трьох цифр N=" << N;

		for (int q = 0; q < 10; q++) {
			for (int w = 0; w < 10; w++) {
				for (int e = 0; e < 10; e++) {
					for (int r = 0; r < 10; r++) {
						for (int t = 0; t < 10; t++) {
							for (int y = 0; y < 10; y++) {
								if ((q + w + e == r + t + y) && (q + w + e == N)) c++;
							}
						}
					}
				}
			}
		}
		cout << "\tусього таких чисел: " << c << "\n";
		count += c;
	}

	cout << "\n\n\tОтже усього щасливих квиткiв з 6-тизначним номером: " << count;
	cout << "\n\n\t";
	
	cout << "\n\tДругий варiант рiшення:\n";
	cout << "\t-------------------------------------------\n";
	count = 0;
	for (int d = 0; d< 28; d++)
	{
		N = d;
		c = 0;
		cout << "\n\t(N<28)  сума перших трьох цифр N=" << N;

		//цикл, перебирающий все варианты первой цифры 
		//трехзначного числа
		for (int i = 0; i < 10; i++)
		{
			//вложенный цикл, перебирающий все 
			//варианты второй цифры
			for (int j = 0; j < 10; j++)
			{
				//условие для третьей цифры
				if (N - i - j >= 0 && N - i - j < 10)
				{
					//подсчет подходящих номеров
					c++;
				}
			}
		}
		//увеличение количества в c раз для шестизначного числа
		cout << "\tусього таких чисел: " << c * c << "\n";

		count += (c*c);

	}

	cout << "\n\n\tОтже усього щасливих квиткiв з 6-тизначним номером: " << count;
	cout << "\n\n\t";

	cout << "\n\tТретiй варiант рiшення:\n";
	cout << "\t-------------------------------------------\n";
	count = 0;
	for (int d = 0; d < 28; d++)
	{

		N = d;
		c = 0;
		cout << "\n\t(N<28)  сума перших трьох цифр N=" << N;

		for (int i = 0; i < 1000; i++)
		{
			int s = i % 10 + (i / 10) % 10 + (i / 100) % 10;
			if (s == N) c++;
		}
		cout << "\tусього таких чисел: " << c * c << "\n";

		count += (c*c);
	}

	
	cout << "\n\n\tОтже усього щасливих квиткiв з 6-тизначним номером: " << count;
	cout << "\n\n\t";


	cout << "\n\n\t";
	system("pause");
	return 0;
}